eNum_1_0_1_1/InformationRegisters/ун30_ОбъектыНумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ун30_ОбъектыНумерации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантНумерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Включить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перезаписывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

eNum_1_0_1_1/InformationRegisters/ун30_ОбъектыНумерации/Ext/ManagerModule.bsl
Процедура ЗаписатьНастройки(Настройки) Экспорт
	
	Менеджер = РегистрыСведений.ун30_ОбъектыНумерации.СоздатьМенеджерЗаписи();
	//Для каждого Настройка Из Настройки Цикл
	//	Менеджер[Настройка.Ключ] = Настройка.Значение;
	//КонецЦикла;
	
	Менеджер.ИмяДокумента 			= Настройки.ИмяДокумента;
	Менеджер.ПредставлениеДокумента = Настройки.ПредставлениеДокумента;
	Менеджер.Включить 				= Настройки.Включить;
	Менеджер.ВариантНумерации 		= Настройки.ВариантНумерации;
	Менеджер.Разделитель 			= Настройки.Разделитель;
	Менеджер.Перезаписывать			= Настройки.Перезаписывать;
	Менеджер.Записать(Истина);
	
КонецПроцедуры

Процедура Включить(ИмяДокумента) Экспорт
	
	Набор = РегистрыСведений.ун30_ОбъектыНумерации.СоздатьНаборЗаписей();
	Набор.Отбор.ИмяДокумента.Установить(ИмяДокумента);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		Менеджер = РегистрыСведений.ун30_ОбъектыНумерации.СоздатьМенеджерЗаписи();
		Менеджер.Включить = Истина;
		
		Менеджер.ИмяДокумента = ИмяДокумента;
		Менеджер.ПредставлениеДокумента = Метаданные.Документы.Найти(ИмяДокумента).Представление();
		Менеджер.ВариантНумерации = 1;
		Менеджер.Разделитель = "-";
		Менеджер.Перезаписывать = Ложь;
		
		Менеджер.Записать();
	Иначе 
		Набор[0].Включить = Истина;
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция БазовыеНастройки(ИмяДокумента) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ун30_ОбъектыНумерации.Включить КАК Включить,
	|	ун30_ОбъектыНумерации.ВариантНумерации КАК ВариантНумерации,
	|	ун30_ОбъектыНумерации.Разделитель КАК Разделитель,
	|	ун30_ОбъектыНумерации.Перезаписывать КАК Перезаписывать
	|ИЗ
	|	РегистрСведений.ун30_ОбъектыНумерации КАК ун30_ОбъектыНумерации
	|ГДЕ
	|	ун30_ОбъектыНумерации.ИмяДокумента = &ИмяДокумента";
	Запрос.УстановитьПараметр("ИмяДокумента", ИмяДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить("Успех", Истина);
		Результат.Вставить("ИмяДокумента", 		ИмяДокумента);
		Результат.Вставить("Включить", 			Выборка.Включить);
		Результат.Вставить("ВариантНумерации", 	Выборка.ВариантНумерации);
		Результат.Вставить("Разделитель", 		Выборка.Разделитель);
		Результат.Вставить("Перезаписывать", 	Выборка.Перезаписывать);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
